package tasks.lesson4

/**
 * УРОК 4 Дополнительные задания для повторения
 * Все классы создаем в отдельном файле
 * Задачи не маленькие. Выполняйте пока не почувствуете, что ориентируетесь в классах.
 * Удачи!
 */

/**
 * Задача 1
 * Создать класс Phone с перемнными memoryMax, memoryUsed, phoneNumber, model
 * Создать экземпляр класса, вывести его пременные в консоль
 * изменить 2-3 переменных и вывести в консоль новые значения переменных телефона
 */

/**
 * Задача 2
 * Создать класс Bottle с переменными name, isAlcohol, volume (литры), currentVolume(При создании бутылка полна)
 * Ответьте себе на вопрос чем отличается объявление переменных в теле класса и в конструкторе класса. Когда что использовать?
 */

/**
 * Задача 3
 * Исправить следующий класс, чтобы он компилировался (без добавления дополнительных переменных)
 */

//class Logger(_text: String) {
//
//    init {
//        println(_text)
//    }
//
//    fun printInternalText() {
//        println(_text)
//    }
//}


/**
 * Задача 4
 * Создать класс Barmen  с переменными age, name. И методом greet() возвращающим приветствие (включая имя).
 */

/**
 * Задача 5
 * создать в классе Bottle метод drink принимающий float, отнимающий указанное количество жидкости от currentVolume
 * и возвращающим true, если было достаточно жидкости и false если не достаточно
 */

/**
 * Задача 6
 * Придумать 2 своих класса с 3+ переменными и 2+ методами.
 */

/**
 * Задача 7
 * Придумать класс Watch(наручные часы) с 3 переменными и 2 методами, взаимодействующими с переменными
 */

/**
 * Задача 8
 * Исправить класс Human:
 * метод getInfoAboutPet() должен возвращает стрингу с именем хозяина и питомца.
 * Создать экземпляр класса Human и протестировать функцию
 */


/**
 * Задача 9
 *
 * Создать класс MotivationGenerator с методом getMotivatingPhrase возвращающим случайную мотивирующую фразу
 */

/**
 * Задача 10**
 * Создать Класс Bar хранящую в себе список Bottle и 1 Barman.
 * И с методом getDrink принимающим название алкоголя и требуемых объем. Если такой напиток есть в баре -
 * из его текущего объема вычитается требуемый объем, а метод возвращает true. Если алкоголя в нужном количестве нет - false.
 * Для простоты предположем что каждого напитка всего по 1 бутылки
 */




