package lesson11.tasks

/**
 * Урок 11
 * Лямбды, сука, сложные :с
 * Если вы еще не учили разработку под андроид - переходите к top10.
 * Удачи!
 */

fun main() {
    task1()
    task2()
    task3()
    task4()
}

/**
 * Задача 1.
 * запустить функцию launchWithDelay из класса Delayer с помощью полной и сокращенной записи.
 * В качестве лямбды можете передать любой вывод в консоль информации.
 */

fun task1() {
    println("\n----Task 1=----")
}

/**
 * Задача 2.
 * Создать копию класса Delayer.
 * Создать тайпалиас MilliSeconds вместо Long
 * и DelayedTask вместо лямбды
 * Создать метод executeTasksWithDelayBetween принимающий 2 лямбды и время которое должно пройти между ними.
 * (используйте тайпалиасы)
 * сам метод запускает первую лямбду, потом делает паузу на указанное кол-во милисекунд и запускает вторую лямбду.
 */

fun task2() {
    println("\n----Task 2=----")
}


/**
 * Задача 3.
 *
 * Разобраться и протестировать класс RedButton.
 * Создать экземпляры кнопки, изменить их листенеры и покликать на кнопку.
 */

fun task3() {
    println("\n----Task 3=----")
}

/**
 * Задача 4*.
 * Создайте лямбду, которая принимает текст и инт,
 * а возвращает String, с текстом повторённым с новой строки столько раз, сколько сказано в инте.
 * Запустите эту лямбду и выведите результат в консоль
 */

fun task4() {
    println("\n----Task 4=----")
}
