/**
 * Задача 1
 * Вывести все элементы массива в консоль в обратном порядке в 1 строку
 */

fun main1() {
    val array = arrayOf("┻━┻)", "╯ (", "°) ", "° □", "(╯ ")
}

/**
 * Задача 2
 * Отсортировать массив в порядке возрастания любыми средствами и вывести в консоль результат
 */

fun main2() {
    val array = arrayOf(21, 88, 71, 62, 21, 4, 55, 7, 44, 0, -11, 1222)
}

/** Задача 3(*)
 * Даны 2 массива одинаковой длины.
 * Создать третий массив, в котором будут чередоваться значения из 1 и 2 массива
 * (т.е. сначала нулевой элемент 1ого массива, потом нулевой элемент второго массива,
 * затем первый элемент первого массива и т д)
 * Вывести элементы финального массива в 1 строку
 */
fun main3() {
    val array = arrayOf("Н", "д", "ж", "а", "-", "м", "й", "к", "м", "а", " ", "е", "н", "й", " ", " ", "д", "ч", " ", " ", "а", "р", "д", " ", "а", "с", "е", "о", "т", ".", "А", "п", "с", "и", "д", "в", "л", "н", " ", "д", "о", ",", "ч", "о", " ", "о", "ь", "о", "о", "д", "м", " ", " ", "е", " ", "е", "о", "ь")
    val secondArray = arrayOf("а", "е", "д", " ", " ", "о", " ", "о", "п", "с", "з", "м", "о", ".", "А", "у", "а", "а", "-", "н", "г", "а", "а", "з", " ", "м", "л", "с", "ь", " ", " ", "е", "н", " ", "о", "о", "ь", "о", "о", "н", "й", " ", "т", "б", "т", "л", "к", " ", " ", "о", "е", "в", "н", "й", "п", "л", "с", "!")
}
