package lesson8.tasks

/**
 * Урок 8
 */

/**
 * Задача 1.
 * Создать метод getInt(), который получает текст из консоли (readLine())
 * и Пытается превратить его в целое число (toInt())
 * если текст из консоли был null - выбросить Exception
 * После чего возвращает этот инт
 * Проверить что будет если ввести "аа" вместо числа
 */


/**
 * Задача 2.
 * Создать метод startGame() которая предлагает певому игроку загадать случайное число от 1 до 10
 * Затем предлагает второму игроку угадать число и говорит сколько попыток понадобилось.
 * Для получения чисел использовать функцию из первого задания.
 * Вызывать функцию так, чтобы при вводе букв программа не крашила, а просто выводила в логи что это недопустимый ввод и
 * сама загадывала случайное число
 *
 */


/**
 * Задача 3*
 * Получить 2 инта из класса BlackBox
 * Если первое число окажется null - написать в консол что первое число null (используя елвис)
 * Если второе число окажется null - написать в консол что второе число null (используя елвис)
 * Использую let вывести в консоль сумму чисел, если оба не null
 */

